In [2]:
import numpy as np
from pandas import Series,DataFrame
import pandas as pd
from numpy.random import randn

In [4]:
ser = Series(randn(6),index=[[1,1,1,2,2,2],['a','b','c','a','b','c']])
ser

1  a   -0.382557
   b    1.579541
   c   -0.401981
2  a   -1.058683
   b   -1.579316
   c    1.119739
dtype: float64

In [5]:
ser.index

MultiIndex(levels=[[1, 2], ['a', 'b', 'c']],
           codes=[[0, 0, 0, 1, 1, 1], [0, 1, 2, 0, 1, 2]])

In [6]:
dframe2

NameError: name 'dframe2' is not defined

In [7]:
ser[1]

a   -0.382557
b    1.579541
c   -0.401981
dtype: float64

In [8]:
ser[2]

a   -1.058683
b   -1.579316
c    1.119739
dtype: float64

In [9]:
ser

1  a   -0.382557
   b    1.579541
   c   -0.401981
2  a   -1.058683
   b   -1.579316
   c    1.119739
dtype: float64

In [10]:
#if you want to know everything associated to a

In [12]:
ser[:,'a'] #it gives you the higher index level and the value

1   -0.382557
2   -1.058683
dtype: float64

In [13]:
dframe = ser.unstack() #this change the index level

In [14]:
dframe

          a         b         c
1 -0.382557  1.579541 -0.401981
2 -1.058683 -1.579316  1.119739

In [15]:
dframe2 = DataFrame(np.arange(16).reshape(4,4,),index=[['a','a','b','b'],[1,2,1,2]],columns=[['NY','NY','LA','SF'],['cold','hot','hot','cold']])

In [16]:
dframe2

      NY      LA   SF
    cold hot hot cold
a 1    0   1   2    3
  2    4   5   6    7
b 1    8   9  10   11
  2   12  13  14   15

In [19]:
dframe2.index.names = ['INDEX_1','INDEX_2']
dframe2.columns.names = ['CITIES','TEMP']

dframe2

CITIES            NY      LA   SF
TEMP            cold hot hot cold
INDEX_1 INDEX_2
a       1          0   1   2    3
        2          4   5   6    7
b       1          8   9  10   11
        2         12  13  14   15

In [20]:
dframe2.swaplevel('CITIES','TEMP',axis=1)#we want to swap the columns not the rows that's why we put axis 1 at 0 is for columns

TEMP            cold hot     cold
CITIES            NY  NY  LA   SF
INDEX_1 INDEX_2
a       1          0   1   2    3
        2          4   5   6    7
b       1          8   9  10   11
        2         12  13  14   15

In [29]:
#to sort levels

In [34]:
dframe2.sort_index(1)

CITIES           LA   NY       SF
TEMP            hot cold hot cold
INDEX_1 INDEX_2
a       1         2    0   1    3
        2         6    4   5    7
b       1        10    8   9   11
        2        14   12  13   15

In [ ]:
#fix it

In [28]:
dframe2.sum(level='TEMP',axis=1)

TEMP             cold  hot
INDEX_1 INDEX_2
a       1           3    3
        2          11   11
b       1          19   19
        2          27   27